quest_system_1091842216_name=^?^The Elixir of Everlasting Youth
quest_system_1091842216_stage_0=^?^Find Igdym Urkurshak and retrieve the recipe from him.
quest_system_1091842216_stage_1=^?^The recipe, damaged by the orc, has been recovered. Return it to the Elves.
quest_system_1091842216_stage_2=^?^Lady Beaulla is horrified that the recipe has been damaged, and asks you to appeal to the Tree of Life for a new recipe.
quest_system_1091842216_stage_3=^?^Give the new recipe to the Elven Lady Beaulla.
quest_system_1091842216_task=^?^Lady Beaulla, of the House of Singing Leaves, has asked you to return to her the recipe for the elixir of everlasting youth. The recipe was stolen by one of the orc-commanders, Igdym Urkurshak, whose troop has hidden in the Great Forest.<br>[reward]
